MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA308/mcu.h
#define _CNPU2_CN17PUE_POSITION                  0x00000001
#define _CNPU2_CN17PUE_MASK                      0x00000002
#define _CNPU2_CN17PUE_LENGTH                    0x00000001

#define _CNPU2_CN18PUE_POSITION                  0x00000002
#define _CNPU2_CN18PUE_MASK                      0x00000004
#define _CNPU2_CN18PUE_LENGTH                    0x00000001

#define _CNPU2_CN19PUE_POSITION                  0x00000003
#define _CNPU2_CN19PUE_MASK                      0x00000008
#define _CNPU2_CN19PUE_LENGTH                    0x00000001

#define _CNPU2_CN20PUE_POSITION                  0x00000004
#define _CNPU2_CN20PUE_MASK                      0x00000010
#define _CNPU2_CN20PUE_LENGTH                    0x00000001

#define _CNPU2_CN21PUE_POSITION                  0x00000005
#define _CNPU2_CN21PUE_MASK                      0x00000020
#define _CNPU2_CN21PUE_LENGTH                    0x00000001

#define _CNPU2_CN22PUE_POSITION                  0x00000006
#define _CNPU2_CN22PUE_MASK                      0x00000040
#define _CNPU2_CN22PUE_LENGTH                    0x00000001

#define _CNPU2_CN23PUE_POSITION                  0x00000007
#define _CNPU2_CN23PUE_MASK                      0x00000080
#define _CNPU2_CN23PUE_LENGTH                    0x00000001

#define _CNPU2_CN24PUE_POSITION                  0x00000008
#define _CNPU2_CN24PUE_MASK                      0x00000100
#define _CNPU2_CN24PUE_LENGTH                    0x00000001

#define _CNPU2_CN25PUE_POSITION                  0x00000009
#define _CNPU2_CN25PUE_MASK                      0x00000200
#define _CNPU2_CN25PUE_LENGTH                    0x00000001

#define _CNPU2_CN26PUE_POSITION                  0x0000000A
#define _CNPU2_CN26PUE_MASK                      0x00000400
#define _CNPU2_CN26PUE_LENGTH                    0x00000001

#define _CNPU2_CN27PUE_POSITION                  0x0000000B
#define _CNPU2_CN27PUE_MASK                      0x00000800
#define _CNPU2_CN27PUE_LENGTH                    0x00000001

#define _CNPU2_CN28PUE_POSITION                  0x0000000C
#define _CNPU2_CN28PUE_MASK                      0x00001000
#define _CNPU2_CN28PUE_LENGTH                    0x00000001

#define _CNPU2_CN29PUE_POSITION                  0x0000000D
#define _CNPU2_CN29PUE_MASK                      0x00002000
#define _CNPU2_CN29PUE_LENGTH                    0x00000001

#define _CNPU2_CN30PUE_POSITION                  0x0000000E
#define _CNPU2_CN30PUE_MASK                      0x00004000
#define _CNPU2_CN30PUE_LENGTH                    0x00000001

#define _CNPU2_CN31PUE_POSITION                  0x0000000F
#define _CNPU2_CN31PUE_MASK                      0x00008000
#define _CNPU2_CN31PUE_LENGTH                    0x00000001

#define _CNPU3_CN32PUE_POSITION                  0x00000000
#define _CNPU3_CN32PUE_MASK                      0x00000001
#define _CNPU3_CN32PUE_LENGTH                    0x00000001

#define _CNPU3_CN41PUE_POSITION                  0x00000009
#define _CNPU3_CN41PUE_MASK                      0x00000200
#define _CNPU3_CN41PUE_LENGTH                    0x00000001

#define _CNPU3_CN42PUE_POSITION                  0x0000000A
#define _CNPU3_CN42PUE_MASK                      0x00000400
#define _CNPU3_CN42PUE_LENGTH                    0x00000001

#define _CNPU3_CN43PUE_POSITION                  0x0000000B
#define _CNPU3_CN43PUE_MASK                      0x00000800
#define _CNPU3_CN43PUE_LENGTH                    0x00000001

#define _CNPU3_CN44PUE_POSITION                  0x0000000C
#define _CNPU3_CN44PUE_MASK                      0x00001000
#define _CNPU3_CN44PUE_LENGTH                    0x00000001

#define _CNPU3_CN45PUE_POSITION                  0x0000000D
#define _CNPU3_CN45PUE_MASK                      0x00002000
#define _CNPU3_CN45PUE_LENGTH                    0x00000001

#define _CNPU3_CN46PUE_POSITION                  0x0000000E
#define _CNPU3_CN46PUE_MASK                      0x00004000
#define _CNPU3_CN46PUE_LENGTH                    0x00000001

#define _CNPU3_CN47PUE_POSITION                  0x0000000F
#define _CNPU3_CN47PUE_MASK                      0x00008000
#define _CNPU3_CN47PUE_LENGTH                    0x00000001

#define _CNPU4_CN49PUE_POSITION                  0x00000001
#define _CNPU4_CN49PUE_MASK                      0x00000002
#define _CNPU4_CN49PUE_LENGTH                    0x00000001

#define _CNPU4_CN50PUE_POSITION                  0x00000002
#define _CNPU4_CN50PUE_MASK                      0x00000004
#define _CNPU4_CN50PUE_LENGTH                    0x00000001

#define _CNPU4_CN51PUE_POSITION                  0x00000003
#define _CNPU4_CN51PUE_MASK                      0x00000008
#define _CNPU4_CN51PUE_LENGTH                    0x00000001

#define _CNPU4_CN52PUE_POSITION                  0x00000004
#define _CNPU4_CN52PUE_MASK                      0x00000010
#define _CNPU4_CN52PUE_LENGTH                    0x00000001

#define _CNPU4_CN53PUE_POSITION                  0x00000005
#define _CNPU4_CN53PUE_MASK                      0x00000020
#define _CNPU4_CN53PUE_LENGTH                    0x00000001

#define _CNPU4_CN54PUE_POSITION                  0x00000006
#define _CNPU4_CN54PUE_MASK                      0x00000040
#define _CNPU4_CN54PUE_LENGTH                    0x00000001

#define _CNPU4_CN55PUE_POSITION                  0x00000007
#define _CNPU4_CN55PUE_MASK                      0x00000080
#define _CNPU4_CN55PUE_LENGTH                    0x00000001

#define _CNPU4_CN56PUE_POSITION                  0x00000008
#define _CNPU4_CN56PUE_MASK                      0x00000100
#define _CNPU4_CN56PUE_LENGTH                    0x00000001

#define _CNPU4_CN57PUE_POSITION                  0x00000009
#define _CNPU4_CN57PUE_MASK                      0x00000200
#define _CNPU4_CN57PUE_LENGTH                    0x00000001

#define _CNPU4_CN58PUE_POSITION                  0x0000000A
#define _CNPU4_CN58PUE_MASK                      0x00000400
#define _CNPU4_CN58PUE_LENGTH                    0x00000001

#define _CNPU4_CN59PUE_POSITION                  0x0000000B
#define _CNPU4_CN59PUE_MASK                      0x00000800
#define _CNPU4_CN59PUE_LENGTH                    0x00000001

#define _CNPU4_CN60PUE_POSITION                  0x0000000C
#define _CNPU4_CN60PUE_MASK                      0x00001000
#define _CNPU4_CN60PUE_LENGTH                    0x00000001

#define _CNPU4_CN61PUE_POSITION                  0x0000000D
#define _CNPU4_CN61PUE_MASK                      0x00002000
#define _CNPU4_CN61PUE_LENGTH                    0x00000001

#define _CNPU4_CN62PUE_POSITION                  0x0000000E
#define _CNPU4_CN62PUE_MASK                      0x00004000
#define _CNPU4_CN62PUE_LENGTH                    0x00000001

#define _CNPU4_CN63PUE_POSITION                  0x0000000F
#define _CNPU4_CN63PUE_MASK                      0x00008000
#define _CNPU4_CN63PUE_LENGTH                    0x00000001

