MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA308/mcu.h
#define _ANSE_ANSE4_POSITION                     0x00000004
#define _ANSE_ANSE4_MASK                         0x00000010
#define _ANSE_ANSE4_LENGTH                       0x00000001

#define _ANSE_ANSE5_POSITION                     0x00000005
#define _ANSE_ANSE5_MASK                         0x00000020
#define _ANSE_ANSE5_LENGTH                       0x00000001

#define _ANSE_ANSE6_POSITION                     0x00000006
#define _ANSE_ANSE6_MASK                         0x00000040
#define _ANSE_ANSE6_LENGTH                       0x00000001

#define _ANSE_ANSE7_POSITION                     0x00000007
#define _ANSE_ANSE7_MASK                         0x00000080
#define _ANSE_ANSE7_LENGTH                       0x00000001

#define _ANSE_ANSE9_POSITION                     0x00000009
#define _ANSE_ANSE9_MASK                         0x00000200
#define _ANSE_ANSE9_LENGTH                       0x00000001

#define _ANSE_ANSELE4_POSITION                   0x00000004
#define _ANSE_ANSELE4_MASK                       0x00000010
#define _ANSE_ANSELE4_LENGTH                     0x00000001

#define _ANSE_ANSELE5_POSITION                   0x00000005
#define _ANSE_ANSELE5_MASK                       0x00000020
#define _ANSE_ANSELE5_LENGTH                     0x00000001

#define _ANSE_ANSELE6_POSITION                   0x00000006
#define _ANSE_ANSELE6_MASK                       0x00000040
#define _ANSE_ANSELE6_LENGTH                     0x00000001

#define _ANSE_ANSELE7_POSITION                   0x00000007
#define _ANSE_ANSELE7_MASK                       0x00000080
#define _ANSE_ANSELE7_LENGTH                     0x00000001

#define _ANSE_ANSELE9_POSITION                   0x00000009
#define _ANSE_ANSELE9_MASK                       0x00000200
#define _ANSE_ANSELE9_LENGTH                     0x00000001

#define _ANSELE_ANSE4_POSITION                   0x00000004
#define _ANSELE_ANSE4_MASK                       0x00000010
#define _ANSELE_ANSE4_LENGTH                     0x00000001

#define _ANSELE_ANSE5_POSITION                   0x00000005
#define _ANSELE_ANSE5_MASK                       0x00000020
#define _ANSELE_ANSE5_LENGTH                     0x00000001

#define _ANSELE_ANSE6_POSITION                   0x00000006
#define _ANSELE_ANSE6_MASK                       0x00000040
#define _ANSELE_ANSE6_LENGTH                     0x00000001

#define _ANSELE_ANSE7_POSITION                   0x00000007
#define _ANSELE_ANSE7_MASK                       0x00000080
#define _ANSELE_ANSE7_LENGTH                     0x00000001

#define _ANSELE_ANSE9_POSITION                   0x00000009
#define _ANSELE_ANSE9_MASK                       0x00000200
#define _ANSELE_ANSE9_LENGTH                     0x00000001

#define _ANSELE_ANSELE4_POSITION                 0x00000004
#define _ANSELE_ANSELE4_MASK                     0x00000010
#define _ANSELE_ANSELE4_LENGTH                   0x00000001

#define _ANSELE_ANSELE5_POSITION                 0x00000005
#define _ANSELE_ANSELE5_MASK                     0x00000020
#define _ANSELE_ANSELE5_LENGTH                   0x00000001

#define _ANSELE_ANSELE6_POSITION                 0x00000006
#define _ANSELE_ANSELE6_MASK                     0x00000040
#define _ANSELE_ANSELE6_LENGTH                   0x00000001

#define _ANSELE_ANSELE7_POSITION                 0x00000007
#define _ANSELE_ANSELE7_MASK                     0x00000080
#define _ANSELE_ANSELE7_LENGTH                   0x00000001

#define _ANSELE_ANSELE9_POSITION                 0x00000009
#define _ANSELE_ANSELE9_MASK                     0x00000200
#define _ANSELE_ANSELE9_LENGTH                   0x00000001

#define _ANSELG_ANSG6_POSITION                   0x00000006
#define _ANSELG_ANSG6_MASK                       0x00000040
#define _ANSELG_ANSG6_LENGTH                     0x00000001

#define _ANSELG_ANSG7_POSITION                   0x00000007
#define _ANSELG_ANSG7_MASK                       0x00000080
#define _ANSELG_ANSG7_LENGTH                     0x00000001

#define _ANSELG_ANSG8_POSITION                   0x00000008
#define _ANSELG_ANSG8_MASK                       0x00000100
#define _ANSELG_ANSG8_LENGTH                     0x00000001

#define _ANSELG_ANSG9_POSITION                   0x00000009
#define _ANSELG_ANSG9_MASK                       0x00000200
#define _ANSELG_ANSG9_LENGTH                     0x00000001

#define _ANSELG_ANSELG6_POSITION                 0x00000006
#define _ANSELG_ANSELG6_MASK                     0x00000040
#define _ANSELG_ANSELG6_LENGTH                   0x00000001

#define _ANSELG_ANSELG7_POSITION                 0x00000007
#define _ANSELG_ANSELG7_MASK                     0x00000080
#define _ANSELG_ANSELG7_LENGTH                   0x00000001

#define _ANSELG_ANSELG8_POSITION                 0x00000008
#define _ANSELG_ANSELG8_MASK                     0x00000100
#define _ANSELG_ANSELG8_LENGTH                   0x00000001

#define _ANSELG_ANSELG9_POSITION                 0x00000009
#define _ANSELG_ANSELG9_MASK                     0x00000200
#define _ANSELG_ANSELG9_LENGTH                   0x00000001

#define _ANSG_ANSG6_POSITION                     0x00000006
#define _ANSG_ANSG6_MASK                         0x00000040
#define _ANSG_ANSG6_LENGTH                       0x00000001

#define _ANSG_ANSG7_POSITION                     0x00000007
#define _ANSG_ANSG7_MASK                         0x00000080
#define _ANSG_ANSG7_LENGTH                       0x00000001

#define _ANSG_ANSG8_POSITION                     0x00000008
#define _ANSG_ANSG8_MASK                         0x00000100
#define _ANSG_ANSG8_LENGTH                       0x00000001

#define _ANSG_ANSG9_POSITION                     0x00000009
#define _ANSG_ANSG9_MASK                         0x00000200
#define _ANSG_ANSG9_LENGTH                       0x00000001

#define _ANSG_ANSELG6_POSITION                   0x00000006
#define _ANSG_ANSELG6_MASK                       0x00000040
#define _ANSG_ANSELG6_LENGTH                     0x00000001

#define _ANSG_ANSELG7_POSITION                   0x00000007
#define _ANSG_ANSELG7_MASK                       0x00000080
#define _ANSG_ANSELG7_LENGTH                     0x00000001

#define _ANSG_ANSELG8_POSITION                   0x00000008
#define _ANSG_ANSELG8_MASK                       0x00000100
#define _ANSG_ANSELG8_LENGTH                     0x00000001

