MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA308/mcu.h
#define _LCDDATA0_S09C0_POSITION                 0x00000009
#define _LCDDATA0_S09C0_MASK                     0x00000200
#define _LCDDATA0_S09C0_LENGTH                   0x00000001

#define _LCDDATA0_S10C0_POSITION                 0x0000000A
#define _LCDDATA0_S10C0_MASK                     0x00000400
#define _LCDDATA0_S10C0_LENGTH                   0x00000001

#define _LCDDATA0_S11C0_POSITION                 0x0000000B
#define _LCDDATA0_S11C0_MASK                     0x00000800
#define _LCDDATA0_S11C0_LENGTH                   0x00000001

#define _LCDDATA0_S12C0_POSITION                 0x0000000C
#define _LCDDATA0_S12C0_MASK                     0x00001000
#define _LCDDATA0_S12C0_LENGTH                   0x00000001

#define _LCDDATA0_S13C0_POSITION                 0x0000000D
#define _LCDDATA0_S13C0_MASK                     0x00002000
#define _LCDDATA0_S13C0_LENGTH                   0x00000001

#define _LCDDATA0_S14C0_POSITION                 0x0000000E
#define _LCDDATA0_S14C0_MASK                     0x00004000
#define _LCDDATA0_S14C0_LENGTH                   0x00000001

#define _LCDDATA0_S15C0_POSITION                 0x0000000F
#define _LCDDATA0_S15C0_MASK                     0x00008000
#define _LCDDATA0_S15C0_LENGTH                   0x00000001

#define _LCDDATA1_S16C0_POSITION                 0x00000000
#define _LCDDATA1_S16C0_MASK                     0x00000001
#define _LCDDATA1_S16C0_LENGTH                   0x00000001

#define _LCDDATA1_S17C0_POSITION                 0x00000001
#define _LCDDATA1_S17C0_MASK                     0x00000002
#define _LCDDATA1_S17C0_LENGTH                   0x00000001

#define _LCDDATA1_S18C0_POSITION                 0x00000002
#define _LCDDATA1_S18C0_MASK                     0x00000004
#define _LCDDATA1_S18C0_LENGTH                   0x00000001

#define _LCDDATA1_S19C0_POSITION                 0x00000003
#define _LCDDATA1_S19C0_MASK                     0x00000008
#define _LCDDATA1_S19C0_LENGTH                   0x00000001

#define _LCDDATA1_S20C0_POSITION                 0x00000004
#define _LCDDATA1_S20C0_MASK                     0x00000010
#define _LCDDATA1_S20C0_LENGTH                   0x00000001

#define _LCDDATA1_S21C0_POSITION                 0x00000005
#define _LCDDATA1_S21C0_MASK                     0x00000020
#define _LCDDATA1_S21C0_LENGTH                   0x00000001

#define _LCDDATA1_S22C0_POSITION                 0x00000006
#define _LCDDATA1_S22C0_MASK                     0x00000040
#define _LCDDATA1_S22C0_LENGTH                   0x00000001

#define _LCDDATA1_S23C0_POSITION                 0x00000007
#define _LCDDATA1_S23C0_MASK                     0x00000080
#define _LCDDATA1_S23C0_LENGTH                   0x00000001

#define _LCDDATA1_S24C0_POSITION                 0x00000008
#define _LCDDATA1_S24C0_MASK                     0x00000100
#define _LCDDATA1_S24C0_LENGTH                   0x00000001

#define _LCDDATA1_S25C0_POSITION                 0x00000009
#define _LCDDATA1_S25C0_MASK                     0x00000200
#define _LCDDATA1_S25C0_LENGTH                   0x00000001

#define _LCDDATA1_S26C0_POSITION                 0x0000000A
#define _LCDDATA1_S26C0_MASK                     0x00000400
#define _LCDDATA1_S26C0_LENGTH                   0x00000001

#define _LCDDATA1_S27C0_POSITION                 0x0000000B
#define _LCDDATA1_S27C0_MASK                     0x00000800
#define _LCDDATA1_S27C0_LENGTH                   0x00000001

#define _LCDDATA1_S28C0_POSITION                 0x0000000C
#define _LCDDATA1_S28C0_MASK                     0x00001000
#define _LCDDATA1_S28C0_LENGTH                   0x00000001

#define _LCDDATA1_S29C0_POSITION                 0x0000000D
#define _LCDDATA1_S29C0_MASK                     0x00002000
#define _LCDDATA1_S29C0_LENGTH                   0x00000001

#define _LCDDATA1_S30C0_POSITION                 0x0000000E
#define _LCDDATA1_S30C0_MASK                     0x00004000
#define _LCDDATA1_S30C0_LENGTH                   0x00000001

#define _LCDDATA1_S31C0_POSITION                 0x0000000F
#define _LCDDATA1_S31C0_MASK                     0x00008000
#define _LCDDATA1_S31C0_LENGTH                   0x00000001

#define _LCDDATA2_S32C0_POSITION                 0x00000000
#define _LCDDATA2_S32C0_MASK                     0x00000001
#define _LCDDATA2_S32C0_LENGTH                   0x00000001

#define _LCDDATA2_S33C0_POSITION                 0x00000001
#define _LCDDATA2_S33C0_MASK                     0x00000002
#define _LCDDATA2_S33C0_LENGTH                   0x00000001

#define _LCDDATA2_S34C0_POSITION                 0x00000002
#define _LCDDATA2_S34C0_MASK                     0x00000004
#define _LCDDATA2_S34C0_LENGTH                   0x00000001

#define _LCDDATA2_S35C0_POSITION                 0x00000003
#define _LCDDATA2_S35C0_MASK                     0x00000008
#define _LCDDATA2_S35C0_LENGTH                   0x00000001

#define _LCDDATA2_S36C0_POSITION                 0x00000004
#define _LCDDATA2_S36C0_MASK                     0x00000010
#define _LCDDATA2_S36C0_LENGTH                   0x00000001

#define _LCDDATA2_S37C0_POSITION                 0x00000005
#define _LCDDATA2_S37C0_MASK                     0x00000020
#define _LCDDATA2_S37C0_LENGTH                   0x00000001

#define _LCDDATA2_S38C0_POSITION                 0x00000006
#define _LCDDATA2_S38C0_MASK                     0x00000040
#define _LCDDATA2_S38C0_LENGTH                   0x00000001

#define _LCDDATA2_S39C0_POSITION                 0x00000007
#define _LCDDATA2_S39C0_MASK                     0x00000080
#define _LCDDATA2_S39C0_LENGTH                   0x00000001

#define _LCDDATA2_S40C0_POSITION                 0x00000008
#define _LCDDATA2_S40C0_MASK                     0x00000100
#define _LCDDATA2_S40C0_LENGTH                   0x00000001

#define _LCDDATA2_S41C0_POSITION                 0x00000009
#define _LCDDATA2_S41C0_MASK                     0x00000200
#define _LCDDATA2_S41C0_LENGTH                   0x00000001

#define _LCDDATA2_S42C0_POSITION                 0x0000000A
#define _LCDDATA2_S42C0_MASK                     0x00000400
#define _LCDDATA2_S42C0_LENGTH                   0x00000001

