MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA308/mcu.h
#define _LCDDATA8_S15C2_POSITION                 0x0000000F
#define _LCDDATA8_S15C2_MASK                     0x00008000
#define _LCDDATA8_S15C2_LENGTH                   0x00000001

#define _LCDDATA9_S16C2_POSITION                 0x00000000
#define _LCDDATA9_S16C2_MASK                     0x00000001
#define _LCDDATA9_S16C2_LENGTH                   0x00000001

#define _LCDDATA9_S17C2_POSITION                 0x00000001
#define _LCDDATA9_S17C2_MASK                     0x00000002
#define _LCDDATA9_S17C2_LENGTH                   0x00000001

#define _LCDDATA9_S18C2_POSITION                 0x00000002
#define _LCDDATA9_S18C2_MASK                     0x00000004
#define _LCDDATA9_S18C2_LENGTH                   0x00000001

#define _LCDDATA9_S19C2_POSITION                 0x00000003
#define _LCDDATA9_S19C2_MASK                     0x00000008
#define _LCDDATA9_S19C2_LENGTH                   0x00000001

#define _LCDDATA9_S20C2_POSITION                 0x00000004
#define _LCDDATA9_S20C2_MASK                     0x00000010
#define _LCDDATA9_S20C2_LENGTH                   0x00000001

#define _LCDDATA9_S21C2_POSITION                 0x00000005
#define _LCDDATA9_S21C2_MASK                     0x00000020
#define _LCDDATA9_S21C2_LENGTH                   0x00000001

#define _LCDDATA9_S22C2_POSITION                 0x00000006
#define _LCDDATA9_S22C2_MASK                     0x00000040
#define _LCDDATA9_S22C2_LENGTH                   0x00000001

#define _LCDDATA9_S23C2_POSITION                 0x00000007
#define _LCDDATA9_S23C2_MASK                     0x00000080
#define _LCDDATA9_S23C2_LENGTH                   0x00000001

#define _LCDDATA9_S24C2_POSITION                 0x00000008
#define _LCDDATA9_S24C2_MASK                     0x00000100
#define _LCDDATA9_S24C2_LENGTH                   0x00000001

#define _LCDDATA9_S25C2_POSITION                 0x00000009
#define _LCDDATA9_S25C2_MASK                     0x00000200
#define _LCDDATA9_S25C2_LENGTH                   0x00000001

#define _LCDDATA9_S26C2_POSITION                 0x0000000A
#define _LCDDATA9_S26C2_MASK                     0x00000400
#define _LCDDATA9_S26C2_LENGTH                   0x00000001

#define _LCDDATA9_S27C2_POSITION                 0x0000000B
#define _LCDDATA9_S27C2_MASK                     0x00000800
#define _LCDDATA9_S27C2_LENGTH                   0x00000001

#define _LCDDATA9_S28C2_POSITION                 0x0000000C
#define _LCDDATA9_S28C2_MASK                     0x00001000
#define _LCDDATA9_S28C2_LENGTH                   0x00000001

#define _LCDDATA9_S29C2_POSITION                 0x0000000D
#define _LCDDATA9_S29C2_MASK                     0x00002000
#define _LCDDATA9_S29C2_LENGTH                   0x00000001

#define _LCDDATA9_S30C2_POSITION                 0x0000000E
#define _LCDDATA9_S30C2_MASK                     0x00004000
#define _LCDDATA9_S30C2_LENGTH                   0x00000001

#define _LCDDATA9_S31C2_POSITION                 0x0000000F
#define _LCDDATA9_S31C2_MASK                     0x00008000
#define _LCDDATA9_S31C2_LENGTH                   0x00000001

#define _LCDDATA10_S32C2_POSITION                0x00000000
#define _LCDDATA10_S32C2_MASK                    0x00000001
#define _LCDDATA10_S32C2_LENGTH                  0x00000001

#define _LCDDATA10_S33C2_POSITION                0x00000001
#define _LCDDATA10_S33C2_MASK                    0x00000002
#define _LCDDATA10_S33C2_LENGTH                  0x00000001

#define _LCDDATA10_S34C2_POSITION                0x00000002
#define _LCDDATA10_S34C2_MASK                    0x00000004
#define _LCDDATA10_S34C2_LENGTH                  0x00000001

#define _LCDDATA10_S35C2_POSITION                0x00000003
#define _LCDDATA10_S35C2_MASK                    0x00000008
#define _LCDDATA10_S35C2_LENGTH                  0x00000001

#define _LCDDATA10_S36C2_POSITION                0x00000004
#define _LCDDATA10_S36C2_MASK                    0x00000010
#define _LCDDATA10_S36C2_LENGTH                  0x00000001

#define _LCDDATA10_S37C2_POSITION                0x00000005
#define _LCDDATA10_S37C2_MASK                    0x00000020
#define _LCDDATA10_S37C2_LENGTH                  0x00000001

#define _LCDDATA10_S38C2_POSITION                0x00000006
#define _LCDDATA10_S38C2_MASK                    0x00000040
#define _LCDDATA10_S38C2_LENGTH                  0x00000001

#define _LCDDATA10_S39C2_POSITION                0x00000007
#define _LCDDATA10_S39C2_MASK                    0x00000080
#define _LCDDATA10_S39C2_LENGTH                  0x00000001

#define _LCDDATA10_S40C2_POSITION                0x00000008
#define _LCDDATA10_S40C2_MASK                    0x00000100
#define _LCDDATA10_S40C2_LENGTH                  0x00000001

#define _LCDDATA10_S41C2_POSITION                0x00000009
#define _LCDDATA10_S41C2_MASK                    0x00000200
#define _LCDDATA10_S41C2_LENGTH                  0x00000001

#define _LCDDATA10_S42C2_POSITION                0x0000000A
#define _LCDDATA10_S42C2_MASK                    0x00000400
#define _LCDDATA10_S42C2_LENGTH                  0x00000001

#define _LCDDATA10_S43C2_POSITION                0x0000000B
#define _LCDDATA10_S43C2_MASK                    0x00000800
#define _LCDDATA10_S43C2_LENGTH                  0x00000001

#define _LCDDATA10_S44C2_POSITION                0x0000000C
#define _LCDDATA10_S44C2_MASK                    0x00001000
#define _LCDDATA10_S44C2_LENGTH                  0x00000001

#define _LCDDATA10_S45C2_POSITION                0x0000000D
#define _LCDDATA10_S45C2_MASK                    0x00002000
#define _LCDDATA10_S45C2_LENGTH                  0x00000001

#define _LCDDATA10_S46C2_POSITION                0x0000000E
#define _LCDDATA10_S46C2_MASK                    0x00004000
#define _LCDDATA10_S46C2_LENGTH                  0x00000001

#define _LCDDATA10_S47C2_POSITION                0x0000000F
#define _LCDDATA10_S47C2_MASK                    0x00008000
#define _LCDDATA10_S47C2_LENGTH                  0x00000001

#define _LCDDATA11_S48C2_POSITION                0x00000000
#define _LCDDATA11_S48C2_MASK                    0x00000001
#define _LCDDATA11_S48C2_LENGTH                  0x00000001

#define _LCDDATA11_S50C2_POSITION                0x00000002
#define _LCDDATA11_S50C2_MASK                    0x00000004
#define _LCDDATA11_S50C2_LENGTH                  0x00000001

#define _LCDDATA12_S00C3_POSITION                0x00000000
#define _LCDDATA12_S00C3_MASK                    0x00000001
#define _LCDDATA12_S00C3_LENGTH                  0x00000001

#define _LCDDATA12_S01C3_POSITION                0x00000001
#define _LCDDATA12_S01C3_MASK                    0x00000002
#define _LCDDATA12_S01C3_LENGTH                  0x00000001

