MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA308/mcu.h
#define _LCDDATA18_S32C4_POSITION                0x00000000
#define _LCDDATA18_S32C4_MASK                    0x00000001
#define _LCDDATA18_S32C4_LENGTH                  0x00000001

#define _LCDDATA18_S33C4_POSITION                0x00000001
#define _LCDDATA18_S33C4_MASK                    0x00000002
#define _LCDDATA18_S33C4_LENGTH                  0x00000001

#define _LCDDATA18_S34C4_POSITION                0x00000002
#define _LCDDATA18_S34C4_MASK                    0x00000004
#define _LCDDATA18_S34C4_LENGTH                  0x00000001

#define _LCDDATA18_S35C4_POSITION                0x00000003
#define _LCDDATA18_S35C4_MASK                    0x00000008
#define _LCDDATA18_S35C4_LENGTH                  0x00000001

#define _LCDDATA18_S36C4_POSITION                0x00000004
#define _LCDDATA18_S36C4_MASK                    0x00000010
#define _LCDDATA18_S36C4_LENGTH                  0x00000001

#define _LCDDATA18_S37C4_POSITION                0x00000005
#define _LCDDATA18_S37C4_MASK                    0x00000020
#define _LCDDATA18_S37C4_LENGTH                  0x00000001

#define _LCDDATA18_S38C4_POSITION                0x00000006
#define _LCDDATA18_S38C4_MASK                    0x00000040
#define _LCDDATA18_S38C4_LENGTH                  0x00000001

#define _LCDDATA18_S39C4_POSITION                0x00000007
#define _LCDDATA18_S39C4_MASK                    0x00000080
#define _LCDDATA18_S39C4_LENGTH                  0x00000001

#define _LCDDATA18_S40C4_POSITION                0x00000008
#define _LCDDATA18_S40C4_MASK                    0x00000100
#define _LCDDATA18_S40C4_LENGTH                  0x00000001

#define _LCDDATA18_S41C4_POSITION                0x00000009
#define _LCDDATA18_S41C4_MASK                    0x00000200
#define _LCDDATA18_S41C4_LENGTH                  0x00000001

#define _LCDDATA18_S42C4_POSITION                0x0000000A
#define _LCDDATA18_S42C4_MASK                    0x00000400
#define _LCDDATA18_S42C4_LENGTH                  0x00000001

#define _LCDDATA18_S43C4_POSITION                0x0000000B
#define _LCDDATA18_S43C4_MASK                    0x00000800
#define _LCDDATA18_S43C4_LENGTH                  0x00000001

#define _LCDDATA18_S44C4_POSITION                0x0000000C
#define _LCDDATA18_S44C4_MASK                    0x00001000
#define _LCDDATA18_S44C4_LENGTH                  0x00000001

#define _LCDDATA18_S45C4_POSITION                0x0000000D
#define _LCDDATA18_S45C4_MASK                    0x00002000
#define _LCDDATA18_S45C4_LENGTH                  0x00000001

#define _LCDDATA18_S46C4_POSITION                0x0000000E
#define _LCDDATA18_S46C4_MASK                    0x00004000
#define _LCDDATA18_S46C4_LENGTH                  0x00000001

#define _LCDDATA18_S47C4_POSITION                0x0000000F
#define _LCDDATA18_S47C4_MASK                    0x00008000
#define _LCDDATA18_S47C4_LENGTH                  0x00000001

#define _LCDDATA19_S48C4_POSITION                0x00000000
#define _LCDDATA19_S48C4_MASK                    0x00000001
#define _LCDDATA19_S48C4_LENGTH                  0x00000001

#define _LCDDATA19_S50C4_POSITION                0x00000002
#define _LCDDATA19_S50C4_MASK                    0x00000004
#define _LCDDATA19_S50C4_LENGTH                  0x00000001

#define _LCDDATA20_S00C5_POSITION                0x00000000
#define _LCDDATA20_S00C5_MASK                    0x00000001
#define _LCDDATA20_S00C5_LENGTH                  0x00000001

#define _LCDDATA20_S01C5_POSITION                0x00000001
#define _LCDDATA20_S01C5_MASK                    0x00000002
#define _LCDDATA20_S01C5_LENGTH                  0x00000001

#define _LCDDATA20_S02C5_POSITION                0x00000002
#define _LCDDATA20_S02C5_MASK                    0x00000004
#define _LCDDATA20_S02C5_LENGTH                  0x00000001

#define _LCDDATA20_S03C5_POSITION                0x00000003
#define _LCDDATA20_S03C5_MASK                    0x00000008
#define _LCDDATA20_S03C5_LENGTH                  0x00000001

#define _LCDDATA20_S04C5_POSITION                0x00000004
#define _LCDDATA20_S04C5_MASK                    0x00000010
#define _LCDDATA20_S04C5_LENGTH                  0x00000001

#define _LCDDATA20_S05C5_POSITION                0x00000005
#define _LCDDATA20_S05C5_MASK                    0x00000020
#define _LCDDATA20_S05C5_LENGTH                  0x00000001

#define _LCDDATA20_S06C5_POSITION                0x00000006
#define _LCDDATA20_S06C5_MASK                    0x00000040
#define _LCDDATA20_S06C5_LENGTH                  0x00000001

#define _LCDDATA20_S07C5_POSITION                0x00000007
#define _LCDDATA20_S07C5_MASK                    0x00000080
#define _LCDDATA20_S07C5_LENGTH                  0x00000001

#define _LCDDATA20_S08C5_POSITION                0x00000008
#define _LCDDATA20_S08C5_MASK                    0x00000100
#define _LCDDATA20_S08C5_LENGTH                  0x00000001

#define _LCDDATA20_S09C5_POSITION                0x00000009
#define _LCDDATA20_S09C5_MASK                    0x00000200
#define _LCDDATA20_S09C5_LENGTH                  0x00000001

#define _LCDDATA20_S10C5_POSITION                0x0000000A
#define _LCDDATA20_S10C5_MASK                    0x00000400
#define _LCDDATA20_S10C5_LENGTH                  0x00000001

#define _LCDDATA20_S11C5_POSITION                0x0000000B
#define _LCDDATA20_S11C5_MASK                    0x00000800
#define _LCDDATA20_S11C5_LENGTH                  0x00000001

#define _LCDDATA20_S12C5_POSITION                0x0000000C
#define _LCDDATA20_S12C5_MASK                    0x00001000
#define _LCDDATA20_S12C5_LENGTH                  0x00000001

#define _LCDDATA20_S13C5_POSITION                0x0000000D
#define _LCDDATA20_S13C5_MASK                    0x00002000
#define _LCDDATA20_S13C5_LENGTH                  0x00000001

#define _LCDDATA20_S14C5_POSITION                0x0000000E
#define _LCDDATA20_S14C5_MASK                    0x00004000
#define _LCDDATA20_S14C5_LENGTH                  0x00000001

#define _LCDDATA20_S15C5_POSITION                0x0000000F
#define _LCDDATA20_S15C5_MASK                    0x00008000
#define _LCDDATA20_S15C5_LENGTH                  0x00000001

