MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA308/mcu.h
#define _LCDDATA24_S00C6_POSITION                0x00000000
#define _LCDDATA24_S00C6_MASK                    0x00000001
#define _LCDDATA24_S00C6_LENGTH                  0x00000001

#define _LCDDATA24_S01C6_POSITION                0x00000001
#define _LCDDATA24_S01C6_MASK                    0x00000002
#define _LCDDATA24_S01C6_LENGTH                  0x00000001

#define _LCDDATA24_S02C6_POSITION                0x00000002
#define _LCDDATA24_S02C6_MASK                    0x00000004
#define _LCDDATA24_S02C6_LENGTH                  0x00000001

#define _LCDDATA24_S03C6_POSITION                0x00000003
#define _LCDDATA24_S03C6_MASK                    0x00000008
#define _LCDDATA24_S03C6_LENGTH                  0x00000001

#define _LCDDATA24_S04C6_POSITION                0x00000004
#define _LCDDATA24_S04C6_MASK                    0x00000010
#define _LCDDATA24_S04C6_LENGTH                  0x00000001

#define _LCDDATA24_S05C6_POSITION                0x00000005
#define _LCDDATA24_S05C6_MASK                    0x00000020
#define _LCDDATA24_S05C6_LENGTH                  0x00000001

#define _LCDDATA24_S06C6_POSITION                0x00000006
#define _LCDDATA24_S06C6_MASK                    0x00000040
#define _LCDDATA24_S06C6_LENGTH                  0x00000001

#define _LCDDATA24_S07C6_POSITION                0x00000007
#define _LCDDATA24_S07C6_MASK                    0x00000080
#define _LCDDATA24_S07C6_LENGTH                  0x00000001

#define _LCDDATA24_S08C6_POSITION                0x00000008
#define _LCDDATA24_S08C6_MASK                    0x00000100
#define _LCDDATA24_S08C6_LENGTH                  0x00000001

#define _LCDDATA24_S09C6_POSITION                0x00000009
#define _LCDDATA24_S09C6_MASK                    0x00000200
#define _LCDDATA24_S09C6_LENGTH                  0x00000001

#define _LCDDATA24_S10C6_POSITION                0x0000000A
#define _LCDDATA24_S10C6_MASK                    0x00000400
#define _LCDDATA24_S10C6_LENGTH                  0x00000001

#define _LCDDATA24_S11C6_POSITION                0x0000000B
#define _LCDDATA24_S11C6_MASK                    0x00000800
#define _LCDDATA24_S11C6_LENGTH                  0x00000001

#define _LCDDATA24_S12C6_POSITION                0x0000000C
#define _LCDDATA24_S12C6_MASK                    0x00001000
#define _LCDDATA24_S12C6_LENGTH                  0x00000001

#define _LCDDATA24_S13C6_POSITION                0x0000000D
#define _LCDDATA24_S13C6_MASK                    0x00002000
#define _LCDDATA24_S13C6_LENGTH                  0x00000001

#define _LCDDATA24_S14C6_POSITION                0x0000000E
#define _LCDDATA24_S14C6_MASK                    0x00004000
#define _LCDDATA24_S14C6_LENGTH                  0x00000001

#define _LCDDATA24_S15C6_POSITION                0x0000000F
#define _LCDDATA24_S15C6_MASK                    0x00008000
#define _LCDDATA24_S15C6_LENGTH                  0x00000001

#define _LCDDATA25_S16C6_POSITION                0x00000000
#define _LCDDATA25_S16C6_MASK                    0x00000001
#define _LCDDATA25_S16C6_LENGTH                  0x00000001

#define _LCDDATA25_S17C6_POSITION                0x00000001
#define _LCDDATA25_S17C6_MASK                    0x00000002
#define _LCDDATA25_S17C6_LENGTH                  0x00000001

#define _LCDDATA25_S18C6_POSITION                0x00000002
#define _LCDDATA25_S18C6_MASK                    0x00000004
#define _LCDDATA25_S18C6_LENGTH                  0x00000001

#define _LCDDATA25_S19C6_POSITION                0x00000003
#define _LCDDATA25_S19C6_MASK                    0x00000008
#define _LCDDATA25_S19C6_LENGTH                  0x00000001

#define _LCDDATA25_S20C6_POSITION                0x00000004
#define _LCDDATA25_S20C6_MASK                    0x00000010
#define _LCDDATA25_S20C6_LENGTH                  0x00000001

#define _LCDDATA25_S21C6_POSITION                0x00000005
#define _LCDDATA25_S21C6_MASK                    0x00000020
#define _LCDDATA25_S21C6_LENGTH                  0x00000001

#define _LCDDATA25_S22C6_POSITION                0x00000006
#define _LCDDATA25_S22C6_MASK                    0x00000040
#define _LCDDATA25_S22C6_LENGTH                  0x00000001

#define _LCDDATA25_S23C6_POSITION                0x00000007
#define _LCDDATA25_S23C6_MASK                    0x00000080
#define _LCDDATA25_S23C6_LENGTH                  0x00000001

#define _LCDDATA25_S24C6_POSITION                0x00000008
#define _LCDDATA25_S24C6_MASK                    0x00000100
#define _LCDDATA25_S24C6_LENGTH                  0x00000001

#define _LCDDATA25_S25C6_POSITION                0x00000009
#define _LCDDATA25_S25C6_MASK                    0x00000200
#define _LCDDATA25_S25C6_LENGTH                  0x00000001

#define _LCDDATA25_S26C6_POSITION                0x0000000A
#define _LCDDATA25_S26C6_MASK                    0x00000400
#define _LCDDATA25_S26C6_LENGTH                  0x00000001

#define _LCDDATA25_S27C6_POSITION                0x0000000B
#define _LCDDATA25_S27C6_MASK                    0x00000800
#define _LCDDATA25_S27C6_LENGTH                  0x00000001

#define _LCDDATA25_S28C6_POSITION                0x0000000C
#define _LCDDATA25_S28C6_MASK                    0x00001000
#define _LCDDATA25_S28C6_LENGTH                  0x00000001

#define _LCDDATA25_S29C6_POSITION                0x0000000D
#define _LCDDATA25_S29C6_MASK                    0x00002000
#define _LCDDATA25_S29C6_LENGTH                  0x00000001

#define _LCDDATA25_S30C6_POSITION                0x0000000E
#define _LCDDATA25_S30C6_MASK                    0x00004000
#define _LCDDATA25_S30C6_LENGTH                  0x00000001

#define _LCDDATA25_S31C6_POSITION                0x0000000F
#define _LCDDATA25_S31C6_MASK                    0x00008000
#define _LCDDATA25_S31C6_LENGTH                  0x00000001

#define _LCDDATA26_S32C6_POSITION                0x00000000
#define _LCDDATA26_S32C6_MASK                    0x00000001
#define _LCDDATA26_S32C6_LENGTH                  0x00000001

#define _LCDDATA26_S33C6_POSITION                0x00000001
#define _LCDDATA26_S33C6_MASK                    0x00000002
#define _LCDDATA26_S33C6_LENGTH                  0x00000001

#define _LCDDATA26_S34C6_POSITION                0x00000002
#define _LCDDATA26_S34C6_MASK                    0x00000004
#define _LCDDATA26_S34C6_LENGTH                  0x00000001

#define _LCDDATA26_S35C6_POSITION                0x00000003
#define _LCDDATA26_S35C6_MASK                    0x00000008
#define _LCDDATA26_S35C6_LENGTH                  0x00000001

#define _LCDDATA26_S36C6_POSITION                0x00000004
#define _LCDDATA26_S36C6_MASK                    0x00000010
#define _LCDDATA26_S36C6_LENGTH                  0x00000001

#define _LCDDATA26_S37C6_POSITION                0x00000005
#define _LCDDATA26_S37C6_MASK                    0x00000020
#define _LCDDATA26_S37C6_LENGTH                  0x00000001

#define _LCDDATA26_S38C6_POSITION                0x00000006
#define _LCDDATA26_S38C6_MASK                    0x00000040
#define _LCDDATA26_S38C6_LENGTH                  0x00000001

#define _LCDDATA26_S39C6_POSITION                0x00000007
#define _LCDDATA26_S39C6_MASK                    0x00000080
#define _LCDDATA26_S39C6_LENGTH                  0x00000001

#define _LCDDATA26_S40C6_POSITION                0x00000008
#define _LCDDATA26_S40C6_MASK                    0x00000100
#define _LCDDATA26_S40C6_LENGTH                  0x00000001

#define _LCDDATA26_S41C6_POSITION                0x00000009
#define _LCDDATA26_S41C6_MASK                    0x00000200
#define _LCDDATA26_S41C6_LENGTH                  0x00000001

#define _LCDDATA26_S42C6_POSITION                0x0000000A
#define _LCDDATA26_S42C6_MASK                    0x00000400
#define _LCDDATA26_S42C6_LENGTH                  0x00000001

#define _LCDDATA26_S43C6_POSITION                0x0000000B
#define _LCDDATA26_S43C6_MASK                    0x00000800
#define _LCDDATA26_S43C6_LENGTH                  0x00000001

#define _LCDDATA26_S44C6_POSITION                0x0000000C
#define _LCDDATA26_S44C6_MASK                    0x00001000
#define _LCDDATA26_S44C6_LENGTH                  0x00000001

