MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA308/mcu.h
#define _MDCON_MDBIT_POSITION                    0x00000000
#define _MDCON_MDBIT_MASK                        0x00000001
#define _MDCON_MDBIT_LENGTH                      0x00000001

#define _MDCON_MDOPOL_POSITION                   0x00000004
#define _MDCON_MDOPOL_MASK                       0x00000010
#define _MDCON_MDOPOL_LENGTH                     0x00000001

#define _MDCON_MDSLR_POSITION                    0x00000005
#define _MDCON_MDSLR_MASK                        0x00000020
#define _MDCON_MDSLR_LENGTH                      0x00000001

#define _MDCON_MDOE_POSITION                     0x00000006
#define _MDCON_MDOE_MASK                         0x00000040
#define _MDCON_MDOE_LENGTH                       0x00000001

#define _MDCON_MDSIDL_POSITION                   0x0000000D
#define _MDCON_MDSIDL_MASK                       0x00002000
#define _MDCON_MDSIDL_LENGTH                     0x00000001

#define _MDCON_MDEN_POSITION                     0x0000000F
#define _MDCON_MDEN_MASK                         0x00008000
#define _MDCON_MDEN_LENGTH                       0x00000001

#define _MDSRC_MS_POSITION                       0x00000000
#define _MDSRC_MS_MASK                           0x0000000F
#define _MDSRC_MS_LENGTH                         0x00000004

#define _MDSRC_SODIS_POSITION                    0x00000007
#define _MDSRC_SODIS_MASK                        0x00000080
#define _MDSRC_SODIS_LENGTH                      0x00000001

#define _MDSRC_MS0_POSITION                      0x00000000
#define _MDSRC_MS0_MASK                          0x00000001
#define _MDSRC_MS0_LENGTH                        0x00000001

#define _MDSRC_MS1_POSITION                      0x00000001
#define _MDSRC_MS1_MASK                          0x00000002
#define _MDSRC_MS1_LENGTH                        0x00000001

#define _MDSRC_MS2_POSITION                      0x00000002
#define _MDSRC_MS2_MASK                          0x00000004
#define _MDSRC_MS2_LENGTH                        0x00000001

#define _MDSRC_MS3_POSITION                      0x00000003
#define _MDSRC_MS3_MASK                          0x00000008
#define _MDSRC_MS3_LENGTH                        0x00000001

#define _MDCAR_CL_POSITION                       0x00000000
#define _MDCAR_CL_MASK                           0x0000000F
#define _MDCAR_CL_LENGTH                         0x00000004

#define _MDCAR_CLSYNC_POSITION                   0x00000005
#define _MDCAR_CLSYNC_MASK                       0x00000020
#define _MDCAR_CLSYNC_LENGTH                     0x00000001

#define _MDCAR_CLPOL_POSITION                    0x00000006
#define _MDCAR_CLPOL_MASK                        0x00000040
#define _MDCAR_CLPOL_LENGTH                      0x00000001

#define _MDCAR_CLODIS_POSITION                   0x00000007
#define _MDCAR_CLODIS_MASK                       0x00000080
#define _MDCAR_CLODIS_LENGTH                     0x00000001

#define _MDCAR_CH_POSITION                       0x00000008
#define _MDCAR_CH_MASK                           0x00000F00
#define _MDCAR_CH_LENGTH                         0x00000004

#define _MDCAR_CHSYNC_POSITION                   0x0000000D
#define _MDCAR_CHSYNC_MASK                       0x00002000
#define _MDCAR_CHSYNC_LENGTH                     0x00000001

#define _MDCAR_CHPOL_POSITION                    0x0000000E
#define _MDCAR_CHPOL_MASK                        0x00004000
#define _MDCAR_CHPOL_LENGTH                      0x00000001

#define _MDCAR_CHODIS_POSITION                   0x0000000F
#define _MDCAR_CHODIS_MASK                       0x00008000
#define _MDCAR_CHODIS_LENGTH                     0x00000001

#define _MDCAR_CL0_POSITION                      0x00000000
#define _MDCAR_CL0_MASK                          0x00000001
#define _MDCAR_CL0_LENGTH                        0x00000001

#define _MDCAR_CL1_POSITION                      0x00000001
#define _MDCAR_CL1_MASK                          0x00000002
#define _MDCAR_CL1_LENGTH                        0x00000001

#define _MDCAR_CL2_POSITION                      0x00000002
#define _MDCAR_CL2_MASK                          0x00000004
#define _MDCAR_CL2_LENGTH                        0x00000001

#define _MDCAR_CL3_POSITION                      0x00000003
#define _MDCAR_CL3_MASK                          0x00000008
#define _MDCAR_CL3_LENGTH                        0x00000001

#define _MDCAR_CH0_POSITION                      0x00000008
#define _MDCAR_CH0_MASK                          0x00000100
#define _MDCAR_CH0_LENGTH                        0x00000001

#define _MDCAR_CH1_POSITION                      0x00000009
#define _MDCAR_CH1_MASK                          0x00000200
#define _MDCAR_CH1_LENGTH                        0x00000001

#define _MDCAR_CH2_POSITION                      0x0000000A
#define _MDCAR_CH2_MASK                          0x00000400
#define _MDCAR_CH2_LENGTH                        0x00000001

#define _MDCAR_CH3_POSITION                      0x0000000B
#define _MDCAR_CH3_MASK                          0x00000800
#define _MDCAR_CH3_LENGTH                        0x00000001

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C2OUT_POSITION                   0x00000001
#define _CMSTAT_C2OUT_MASK                       0x00000002
#define _CMSTAT_C2OUT_LENGTH                     0x00000001

#define _CMSTAT_C3OUT_POSITION                   0x00000002
#define _CMSTAT_C3OUT_MASK                       0x00000004
#define _CMSTAT_C3OUT_LENGTH                     0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000008
#define _CMSTAT_C1EVT_MASK                       0x00000100
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_C2EVT_POSITION                   0x00000009
#define _CMSTAT_C2EVT_MASK                       0x00000200
#define _CMSTAT_C2EVT_LENGTH                     0x00000001

#define _CMSTAT_C3EVT_POSITION                   0x0000000A
#define _CMSTAT_C3EVT_MASK                       0x00000400
#define _CMSTAT_C3EVT_LENGTH                     0x00000001

#define _CMSTAT_CMIDL_POSITION                   0x0000000F
#define _CMSTAT_CMIDL_MASK                       0x00008000
#define _CMSTAT_CMIDL_LENGTH                     0x00000001

#define _CVRCON_CVR_POSITION                     0x00000000
#define _CVRCON_CVR_MASK                         0x0000000F
#define _CVRCON_CVR_LENGTH                       0x00000004

#define _CVRCON_CVRSS_POSITION                   0x00000004
#define _CVRCON_CVRSS_MASK                       0x00000010
#define _CVRCON_CVRSS_LENGTH                     0x00000001

#define _CVRCON_CVRR_POSITION                    0x00000005
#define _CVRCON_CVRR_MASK                        0x00000020
#define _CVRCON_CVRR_LENGTH                      0x00000001

#define _CVRCON_CVROE_POSITION                   0x00000006
#define _CVRCON_CVROE_MASK                       0x00000040
#define _CVRCON_CVROE_LENGTH                     0x00000001

#define _CVRCON_CVREN_POSITION                   0x00000007
#define _CVRCON_CVREN_MASK                       0x00000080
#define _CVRCON_CVREN_LENGTH                     0x00000001

#define _CVRCON_CVREFM_POSITION                  0x00000008
#define _CVRCON_CVREFM_MASK                      0x00000300
#define _CVRCON_CVREFM_LENGTH                    0x00000002

#define _CVRCON_CVREFP_POSITION                  0x0000000A
#define _CVRCON_CVREFP_MASK                      0x00000400
#define _CVRCON_CVREFP_LENGTH                    0x00000001

